# Пункт 1
# рекурсивный подсчет символов содержимого файлов, оканчивающихся на 1
# рез в /tmp/результат, ошибки в /tmp/ошибки
cd ~/lab0
mkdir -p tmp
touch /tmp/errors1 /tmp/result1

cd ~ 
ls -R ~/lab0 2>/tmp/errors1 | grep '1$' 2>>~/lab0/tmp/errors1 | wc -m >~/lab0/tmp/result1

# Пункт 2
# Вывести четыре первых элемента рекурсивного списка имен и атрибутов файлов в директории lab0, 
# заканчивающихся на символ 'e',
# список отсортировать по возрастанию даты изменения записи о файле, 
# подавить вывод ошибок доступа
ls -lR ~/lab0 2>/dev/null | grep 'e$' | sort -k6,7 | head -n 4

# Пункт 3
# Вывести содержимое файлов: hippowdon, mankey с номерами строк, оставить только строки, заканчивающиеся на 'e', регистр символов игнорировать, добавить вывод ошибок доступа в стандартный поток вывода
cat -n ~/lab0/klang0/hippowdon ~/lab0/klang0/mankey 2>&1 | grep -i 'e$'

# Пункт 4 
# Вывести содержимое файла porygon21 с номерами строк, оставить только строки, содержащие "fe", регистр символов игнорировать, ошибки доступа не подавлять и не перенаправлять
cat -n ~/lab0/porygon21 | grep -i 'fe'

# Пункт 5
# Вывести список имен и атрибутов файлов в директории sewaddle6, список отсортировать по возрастанию даты изменения записи о файле, добавить вывод ошибок доступа в стандартный поток вывода
ls -ltr ~/lab0/sewaddle6 2>&1

# Пункт 6
# Рекурсивно вывести содержимое файлов с номерами строк из директории lab0, имя которых заканчивается на 'n', строки отсортировать по имени a->z, подавить вывод ошибок доступа
cat -n ~/lab0/*n ~/lab0/*/*n 2>/dev/null | sort

