# Author = Gevorkyan Aleksey Stanislavovich
# Group = P3118
# Date = 26.10.2025


# Написать регулярное выражение, которое проверяет,
# что пароль соответствует этим шести требованиям 
# и после ввода пароля сообщать о том, какое из требований не выполнено.

# Количество цифр в вашем пароле должно составлять 25.
# В вашем пароле должен быть указан месяц года.
# В вашем пароле должен быть специальный символ.
# В вашем пароле должна быть заглавная буква.
# Ваш пароль должен содержать цифру.
# Длина вашего пароля должна составлять не менее 5 символов.

import re

def solve(text):
    digit_count = len(re.findall(r'\d', text))
    if digit_count != 25:
        print("Количество цифр в вашем пароле должно составлять 25.")

    requirements = [
        (r'(?i)(?<![А-ЯЁа-яё])(?:январь|февраль|март|апрель|май|июнь|июль|август|сентябрь|октябрь|ноябрь|декабрь)(?![А-ЯЁа-яё])', "В вашем пароле должен быть указан месяц года."),
        (r'[!@#$%^&*(),.?":{}|<>]', "В вашем пароле должен быть специальный символ."),
        (r'[A-ZА-Я]', "В вашем пароле должна быть заглавная буква."),
        (r'\d', "Ваш пароль должен содержать цифру."),
        (r'.{5,}', "Длина вашего пароля должна составлять не менее 5 символов.")
    ]

    for pattern, message in requirements:
        if not re.search(pattern, text):
            print(message)


if __name__ == "__main__":
    text = input("Введите пароль: ")
    solve(text)
