# Author = Gevorkyan Aleksey Stanislavovich
# Group = P3118
# Date = 26.10.2025

# Необходимо найти в тексте каждый фрагмент, где сначала идёт слово «ВТ»,
# затем не более 4 слов, и после этого идёт слово «ИТМО».
import re


def find_VT_ITMO(text):
    # Ищем слово "ВТ", затем не более 4 слов (слова могут разделяться любыми не-словесными символами), затем слово "ИТМО"
    # Пример подходящего шаблона: "ВТ слово1 слово2 ИТМО" или "ВТ, слово1; слово2 ИТМО"
    pattern = r"\bВТ\b(?:\W+\w+){0,4}\W+\bИТМО\b"
    # \bВТ\b - слово "ВТ"
    # (?:\W+\w+){0,4} - от 0 до 4 повторений: разделитель (не-символ слова) + слово
    # \W+\bИТМО\b - разделитель(и) + слово "ИТМО"
    return re.findall(pattern, text)

if __name__ == "__main__":
    text = input()
    matches = find_VT_ITMO(text)
    
    for match in matches:
        print(match)
