# Author = Gevorkyan Aleksey Stanislavovich
# Group = P3118
# Date = 10.11.2025


# Написать регулярное выражение, которое проверяет,
# что пароль соответствует этим шести требованиям 
# и после ввода пароля сообщать о том, какое из требований не выполнено.

# Сумма цифр в вашем пароле должна составлять 25.
# В вашем пароле должен быть указан месяц года.
# В вашем пароле должен быть специальный символ.
# В вашем пароле должна быть заглавная буква.
# Ваш пароль должен содержать цифру.
# Длина вашего пароля должна составлять не менее 5 символов.

import re

def get_problems(text):
    problems = []

    # Вычисляем сумму цифр и наличие цифр
    digits = re.findall(r'\d', text)
    digit_sum = sum(map(int, digits)) if digits else 0
    if digit_sum != 25:
        problems.append(f"Сумма всех цифр в вашем пароле должна составлять 25. (текущая сумма: {digit_sum})")

    months = ["январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь"]
    for month in months:
        if month.lower() in text.lower():
            break
    else:
        problems.append("В вашем пароле должен быть указан месяц года.")

    # Спецсимвол — любой символ, который не буква/цифра/подчёркивание и не пробельный
    if not re.search(r"[^\w\s]", text):
        problems.append("В вашем пароле должен быть специальный символ.")

    # Заглавная буква (русская или латинская)
    if not re.search(r"[A-ZА-ЯЁ]", text):
        problems.append("В вашем пароле должна быть заглавная буква.")

    if len(text) < 5:
        problems.append("Длина вашего пароля должна составлять не менее 5 символов.")

    return problems


def solve(text):
    problems = get_problems(text)
    for m in problems:
        print(m)


if __name__ == "__main__":
    text = input("Введите пароль: ")
    solve(text)
