import re



# Найти все слова длины ровно 4 буквы (латиница или кириллица).
str1 = 'a ab abc abcd абв авбг ав12 боба эба'
task1 = re.findall(r"[a-zа-я]{4}", str1.lower())
#print(task1)

# Найти все слова, которые начинаются с заглавной буквы (например, имена).
str2 = "леша Петя vanek Maksim HELLO"
task2 = re.findall(r"\b[А-ЯA-Z]\w+\b", str2)
#print(task2)

# Найти все простые email-подобные строки формата user@domain (без проверки TLD).
str3 = "varo11@lano.ru"
task3 = re.findall(r"\w{5,}@\w{3,}.\w{2,}", str3)
print(task3)

# Найти даты в формате DD.MM.YYYY (дни/месяцы с ведущим нулём допустимы).

# Найти времена в формате HH:MM (24‑часовой формат, часы 00–23, минуты 00–59 — упрощённо можно допускать 00–59 для часов).
# Найти слова, где подряд идут две одинаковые буквы (например, книга не подходит, гг в слове — подходит).
# Найти все слова, состоящие только из гласных букв (русские гласные).
# Найти хэштеги в тексте — слова начинающиеся с # и состоящие из букв/цифр/подчеркиваний.
# Найти IP‑подобные группы четырёх чисел от 0 до 255, разделённых точками (упрощённо: 0–255 не валидация строго, а 0–999 допустимы — укажу при запросе).
# Найти ссылки, начинающиеся с http:// или https://, до первого пробел